HopeFOAM-0.1/tutorials/mesh/foamyHexMesh/mixerVessel/system/collapseDict
collapseDict.collapseFaces